<h2>1. Load Database<h2>

In [29]:
import pandas as pd
#import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

<h3>1.1. Create dataframe<h3>

In [30]:
df = pd.read_csv("bank.csv",sep='|',encoding='utf8')

<h2>2. Data Exploration<h2>

<h3>2.1. view first 5 rows in df<h3>

In [31]:
df.head()

,Unnamed: 0,age,job,marital,education,default,housing,loan,contact,month,...,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y
0,14406,39.0,admin.,married,university.degree,no,no,no,cellular,jul,...,3.0,999,0,nonexistent,1.4,93.918,-42.7,4.962,5228.1,no
1,33359,48.0,management,married,basic.9y,no,yes,no,cellular,may,...,NaN,999,0,nonexistent,-1.8,92.893,-46.2,1.291,5099.1,yes
2,11798,51.0,management,married,university.degree,NaN,no,no,telephone,jun,...,10.0,999,0,nonexistent,1.4,94.465,-41.8,4.959,5228.1,no
3,30755,48.0,blue-collar,single,basic.4y,NaN,yes,yes,cellular,may,...,1.0,999,0,nonexistent,-1.8,92.893,-46.2,1.344,5099.1,no
4,10635,51.0,blue-collar,married,basic.4y,NaN,no,yes,telephone,jun,...,1.0,999,0,nonexistent,1.4,94.465,-41.8,4.961,5228.1,yes

<h3>2.2. Presenting all columns, number of rows and type<h3>

In [32]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 39896 entries, 0 to 39895
Data columns (total 22 columns):
Unnamed: 0        39896 non-null int64
age               38647 non-null float64
job               39896 non-null object
marital           39821 non-null object
education         38246 non-null object
default           31599 non-null object
housing           38949 non-null object
loan              38949 non-null object
contact           39896 non-null object
month             39896 non-null object
day_of_week       39896 non-null object
duration          39896 non-null int64
campaign          38307 non-null float64
pdays             39896 non-null int64
previous          39896 non-null int64
poutcome          39896 non-null object
emp.var.rate      39896 non-null float64
cons.price.idx    39896 non-null float64
cons.conf.idx     39896 non-null float64
euribor3m         39896 non-null float64
nr.employed       39896 non-null float64
y                 39896 non-null object
dtypes: float64(7), int64(4), object(11)
memory usage: 6.7+ MB

<h3>2.3. Feature statistics for numerical categories<h3>

In [33]:
df.describe()

,Unnamed: 0,age,duration,campaign,pdays,previous,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed
count,39896.000000,38647.000000,39896.000000,38307.000000,39896.000000,39896.000000,39896.000000,39896.000000,39896.000000,39896.000000,39896.000000
mean,20564.513585,40.008616,258.017270,2.565145,962.236490,0.171596,0.086803,93.575031,-40.478534,3.628298,5167.335725
std,11876.688895,10.419387,259.023346,2.761023,187.503133,0.490421,1.570456,0.579190,4.629417,1.732015,72.101274
min,0.000000,17.000000,0.000000,1.000000,0.000000,0.000000,-3.400000,92.201000,-50.800000,0.634000,4963.600000
25%,10300.500000,32.000000,102.000000,1.000000,999.000000,0.000000,-1.800000,93.075000,-42.700000,1.344000,5099.100000
50%,20548.000000,38.000000,179.000000,2.000000,999.000000,0.000000,1.100000,93.749000,-41.800000,4.857000,5191.000000
75%,30850.250000,47.000000,319.000000,3.000000,999.000000,0.000000,1.400000,93.994000,-36.400000,4.961000,5228.100000
max,41187.000000,98.000000,4918.000000,56.000000,999.000000,7.000000,1.400000,94.767000,-26.900000,5.045000,5228.100000

<h3>2.4. Categorial manipulations:<h3>

<h4>2.4.1 change "yes" or "no" to 1 or 0<h4>

In [ ]:
df['y'] = df.y.eq('yes').mul(1)

<h4>2.4.2 Convert the month list to 4 binary quarters column <h4>

In [ ]:
months=['jan','feb','mar','apr','may','jun','jul','aug','sep','oct','nov','dec'];
df['Q1']=df.month.replace(months,[1,1,1,0,0,0,0,0,0,0,0,0]);
df['Q2']=df.month.replace(months,[0,0,0,1,1,1,0,0,0,0,0,0]);
df['Q3']=df.month.replace(months,[0,0,0,0,0,0,1,1,1,0,0,0]);
df['Q4']=df.month.replace(months,[0,0,0,0,0,0,0,0,0,1,1,1]);
df=df.drop('month', axis=1)

<h4>2.4.3 Change more features - NEED TO COMPLETE<h4>

<h3>2.5.correlation heat map<h3>

In [ ]:
plt.figure()
cor = df.corr()
sns.heatmap(cor, annot=False, cmap='jet')
plt.show()

<h2>3. Missing Values<h2>

<h3>3.1. Count and show NaN values in rows <h3>

In [35]:
df.isnull().sum()

Unnamed: 0           0
age               1249
job                  0
marital             75
education         1650
default           8297
housing            947
loan               947
contact              0
month                0
day_of_week          0
duration             0
campaign          1589
pdays                0
previous             0
poutcome             0
emp.var.rate         0
cons.price.idx       0
cons.conf.idx        0
euribor3m            0
nr.employed          0
y                    0
dtype: int64